yycliang/6.115-Guitar-Learner/Guitar Learner.cydsn/Generated_Source/PSoC5/ADC_SOUND_IN.c
/*******************************************************************************
* File Name: ADC_SOUND_IN.c
* Version 3.20
*
* Description:
*  This file provides the source code to the API for the Delta-Sigma ADC
*  Component.
*
* Note:
*
********************************************************************************
* Copyright 2008-2015, Cypress Semiconductor Corporation.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions,
* disclaimers, and limitations in the end user license agreement accompanying
* the software package with which this file was provided.
*******************************************************************************/

#include "ADC_SOUND_IN.h"

#if(ADC_SOUND_IN_DEFAULT_INTERNAL_CLK)
    #include "ADC_SOUND_IN_theACLK.h"
#endif /* ADC_SOUND_IN_DEFAULT_INTERNAL_CLK */

#include "ADC_SOUND_IN_Ext_CP_Clk.h"

#if(ADC_SOUND_IN_DEFAULT_INPUT_MODE)
    #include "ADC_SOUND_IN_AMux.h"
#endif /* ADC_SOUND_IN_DEFAULT_INPUT_MODE */


/***************************************
* Global data allocation
***************************************/

/* Software flag for checking conversion completed or not */
volatile uint8 ADC_SOUND_IN_convDone = 0u;

/* Software flag to stop conversion for single sample conversion mode
*   with resolution above 16 bits 
*/
volatile uint8 ADC_SOUND_IN_stopConversion = 0u;

/* To run the initialization block only at the start up */
uint8 ADC_SOUND_IN_initVar = 0u;

/* To check whether ADC started or not before switching the configuration */
volatile uint8 ADC_SOUND_IN_started = 0u;

/* Flag to hold ADC config number. By default active config is 1. */
volatile uint8 ADC_SOUND_IN_Config = 1u;

volatile int32 ADC_SOUND_IN_Offset;
volatile int32 ADC_SOUND_IN_CountsPerVolt;


/***************************************
* Local data allocation
***************************************/

/* The array with precalculated gain compensation coefficients */
static ADC_SOUND_IN_GCOR_STRUCT ADC_SOUND_IN_gcor[ADC_SOUND_IN_DEFAULT_NUM_CONFIGS];



/***************************************
* Forward function references
***************************************/
static void ADC_SOUND_IN_InitConfig(uint8 config) ;
static void ADC_SOUND_IN_GainCompensation(uint8 inputRange, uint16 idealDecGain, uint16 idealOddDecGain, 
                            uint8 resolution, uint8 config) ;
static void ADC_SOUND_IN_SetDSMRef0Reg(uint8 value) ;


/******************************************************************************
* Function Name: ADC_SOUND_IN_Init
*******************************************************************************
*
* Summary:
*  Initialize component's parameters to the parameters set by user in the
*  customizer of the component placed onto schematic. Usually called in
* ADC_SOUND_IN_Start().
*
*
* Parameters:
*  None
*
* Return:
*  None
*
*******************************************************************************/
void ADC_SOUND_IN_Init(void) 
{

    ADC_SOUND_IN_Config = 1u;
    ADC_SOUND_IN_convDone = 0u;

    ADC_SOUND_IN_Ext_CP_Clk_SetMode(CYCLK_DUTY);

    /* This is only valid if there is an internal clock */
    #if(ADC_SOUND_IN_DEFAULT_INTERNAL_CLK)
        ADC_SOUND_IN_theACLK_SetMode(CYCLK_DUTY);
    #endif /* ADC_SOUND_IN_DEFAULT_INTERNAL_CLK */

    #if(ADC_SOUND_IN_IRQ_REMOVE == 0u)
        /* Set interrupt priority */
        CyIntSetPriority(ADC_SOUND_IN_INTC_NUMBER, ADC_SOUND_IN_INTC_PRIOR_NUMBER);
    #endif   /* End ADC_SOUND_IN_IRQ_REMOVE */

    /* Init static registers with common configuration */
    ADC_SOUND_IN_DSM_DEM0_REG    = ADC_SOUND_IN_CFG1_DSM_DEM0;
    ADC_SOUND_IN_DSM_DEM1_REG    = ADC_SOUND_IN_CFG1_DSM_DEM1;
    ADC_SOUND_IN_DSM_MISC_REG    = ADC_SOUND_IN_CFG1_DSM_MISC;
    ADC_SOUND_IN_DSM_CLK_REG    |= ADC_SOUND_IN_CFG1_DSM_CLK;
    ADC_SOUND_IN_DSM_REF1_REG    = ADC_SOUND_IN_CFG1_DSM_REF1;

    ADC_SOUND_IN_DSM_OUT0_REG    = ADC_SOUND_IN_CFG1_DSM_OUT0;
    ADC_SOUND_IN_DSM_OUT1_REG    = ADC_SOUND_IN_CFG1_DSM_OUT1;

    ADC_SOUND_IN_DSM_CR0_REG     = ADC_SOUND_IN_CFG1_DSM_CR0;
    ADC_SOUND_IN_DSM_CR1_REG     = ADC_SOUND_IN_CFG1_DSM_CR1;
#if(ADC_SOUND_IN_MI_ENABLE != 0u) /* Enable Modulator Input */
    ADC_SOUND_IN_DSM_CR3_REG     |= ADC_SOUND_IN_DSM_MODBIT_EN;
#else
    ADC_SOUND_IN_DSM_CR3_REG     = ADC_SOUND_IN_CFG1_DSM_CR3;
#endif /* ADC_SOUND_IN_MI_ENABLE != 0u*/    
    ADC_SOUND_IN_DSM_CR8_REG     = ADC_SOUND_IN_CFG1_DSM_CR8;
    ADC_SOUND_IN_DSM_CR9_REG     = ADC_SOUND_IN_CFG1_DSM_CR9;
    ADC_SOUND_IN_DSM_CR13_REG    = ADC_SOUND_IN_CFG1_DSM_CR13;

    ADC_SOUND_IN_DEC_SR_REG      = ADC_SOUND_IN_CFG1_DEC_SR;

    /* Calculate Gain compensation coefficients for all configurations */
    ADC_SOUND_IN_GainCompensation(ADC_SOUND_IN_CFG1_INPUT_RANGE,
                                      ADC_SOUND_IN_CFG1_IDEAL_DEC_GAIN,
                                      ADC_SOUND_IN_CFG1_IDEAL_ODDDEC_GAIN,
                                      ADC_SOUND_IN_CFG1_RESOLUTION,
                                      ADC_SOUND_IN_CFG1);
    #if(ADC_SOUND_IN_DEFAULT_NUM_CONFIGS > 1)
        ADC_SOUND_IN_GainCompensation(ADC_SOUND_IN_CFG2_INPUT_RANGE,
                                          ADC_SOUND_IN_CFG2_IDEAL_DEC_GAIN,
                                          ADC_SOUND_IN_CFG2_IDEAL_ODDDEC_GAIN,
                                          ADC_SOUND_IN_CFG2_RESOLUTION,
                                          ADC_SOUND_IN_CFG2);
    #endif /* ADC_SOUND_IN_DEFAULT_NUM_CONFIGS > 1 */
    #if(ADC_SOUND_IN_DEFAULT_NUM_CONFIGS > 2)
        ADC_SOUND_IN_GainCompensation(ADC_SOUND_IN_CFG3_INPUT_RANGE,
                                          ADC_SOUND_IN_CFG3_IDEAL_DEC_GAIN,
                                          ADC_SOUND_IN_CFG3_IDEAL_ODDDEC_GAIN,
                                          ADC_SOUND_IN_CFG3_RESOLUTION,
                                          ADC_SOUND_IN_CFG3);
    #endif /* ADC_SOUND_IN_DEFAULT_NUM_CONFIGS > 2 */
    #if(ADC_SOUND_IN_DEFAULT_NUM_CONFIGS > 3)
        ADC_SOUND_IN_GainCompensation(ADC_SOUND_IN_CFG4_INPUT_RANGE,
                                          ADC_SOUND_IN_CFG4_IDEAL_DEC_GAIN,
                                          ADC_SOUND_IN_CFG4_IDEAL_ODDDEC_GAIN,
                                          ADC_SOUND_IN_CFG4_RESOLUTION,
                                          ADC_SOUND_IN_CFG4);
    #endif /* ADC_SOUND_IN_DEFAULT_NUM_CONFIGS > 3 */

    /* Set GCOR register for config1 */
    ADC_SOUND_IN_DEC_GVAL_REG = ADC_SOUND_IN_gcor[ADC_SOUND_IN_Config - 1u].gval;
    CY_SET_REG16(ADC_SOUND_IN_DEC_GCOR_16B_PTR, ADC_SOUND_IN_gcor[ADC_SOUND_IN_Config - 1u].gcor);

