yycliang/6.115-Guitar-Learner/Guitar Learner.cydsn/Generated_Source/PSoC5/ADC_SOUND_IN.c
    /* Initialize the registers with default customizer settings for config1 */
    ADC_SOUND_IN_InitConfig(ADC_SOUND_IN_Config);
}


/******************************************************************************
* Function Name: ADC_SOUND_IN_Enable
*******************************************************************************
*
* Summary:
*  Enables the ADC DelSig block operation.
*
*
* Parameters:
*  None
*
* Return:
*  None
*
*******************************************************************************/
void ADC_SOUND_IN_Enable(void) 
{
	uint8 config;
    uint8 enableInterrupts;
    enableInterrupts = CyEnterCriticalSection();

    /* Read volatile variable to the local variable */
    config = ADC_SOUND_IN_Config;
    
    /* Enable active mode power for ADC */
    ADC_SOUND_IN_PWRMGR_DEC_REG |= ADC_SOUND_IN_ACT_PWR_DEC_EN;
    ADC_SOUND_IN_PWRMGR_DSM_REG |= ADC_SOUND_IN_ACT_PWR_DSM_EN;

     /* Enable alternative active mode power for ADC */
    ADC_SOUND_IN_STBY_PWRMGR_DEC_REG |= ADC_SOUND_IN_STBY_PWR_DEC_EN;
    ADC_SOUND_IN_STBY_PWRMGR_DSM_REG |= ADC_SOUND_IN_STBY_PWR_DSM_EN;

    /* Disable PRES, Enable power to VCMBUF0, REFBUF0 and REFBUF1, enable PRES */
    ADC_SOUND_IN_RESET_CR4_REG |= ADC_SOUND_IN_IGNORE_PRESA1;
    ADC_SOUND_IN_RESET_CR5_REG |= ADC_SOUND_IN_IGNORE_PRESA2;

    ADC_SOUND_IN_DSM_CR17_REG |= (ADC_SOUND_IN_DSM_EN_BUF_VREF | ADC_SOUND_IN_DSM_EN_BUF_VCM);

    /* Code to disable the REFBUF0 if reference chosen is External ref */
    #if (((ADC_SOUND_IN_CFG1_REFERENCE == ADC_SOUND_IN_EXT_REF_ON_P03) || \
          (ADC_SOUND_IN_CFG1_REFERENCE == ADC_SOUND_IN_EXT_REF_ON_P32)) || \
         ((ADC_SOUND_IN_DEFAULT_NUM_CONFIGS > 1) && \
          ((ADC_SOUND_IN_CFG2_REFERENCE == ADC_SOUND_IN_EXT_REF_ON_P03) ||  \
           (ADC_SOUND_IN_CFG2_REFERENCE == ADC_SOUND_IN_EXT_REF_ON_P32))) || \
         ((ADC_SOUND_IN_DEFAULT_NUM_CONFIGS > 2) && \
          ((ADC_SOUND_IN_CFG3_REFERENCE == ADC_SOUND_IN_EXT_REF_ON_P03) ||  \
           (ADC_SOUND_IN_CFG3_REFERENCE == ADC_SOUND_IN_EXT_REF_ON_P32))) || \
         ((ADC_SOUND_IN_DEFAULT_NUM_CONFIGS > 3) && \
          ((ADC_SOUND_IN_CFG4_REFERENCE == ADC_SOUND_IN_EXT_REF_ON_P03) || \
           (ADC_SOUND_IN_CFG4_REFERENCE == ADC_SOUND_IN_EXT_REF_ON_P32))))
        if (((config == 1u) &&
            ((ADC_SOUND_IN_CFG1_REFERENCE == ADC_SOUND_IN_EXT_REF_ON_P03) ||
             (ADC_SOUND_IN_CFG1_REFERENCE == ADC_SOUND_IN_EXT_REF_ON_P32))) ||
            ((config == 2u) &&
            ((ADC_SOUND_IN_CFG2_REFERENCE == ADC_SOUND_IN_EXT_REF_ON_P03) ||
             (ADC_SOUND_IN_CFG2_REFERENCE == ADC_SOUND_IN_EXT_REF_ON_P32))) ||
            ((config == 3u) &&
            ((ADC_SOUND_IN_CFG3_REFERENCE == ADC_SOUND_IN_EXT_REF_ON_P03) ||
             (ADC_SOUND_IN_CFG3_REFERENCE == ADC_SOUND_IN_EXT_REF_ON_P32))) ||
            ((config == 4u) &&
            ((ADC_SOUND_IN_CFG4_REFERENCE == ADC_SOUND_IN_EXT_REF_ON_P03) ||
             (ADC_SOUND_IN_CFG4_REFERENCE == ADC_SOUND_IN_EXT_REF_ON_P32))))
        {
            /* Disable the REFBUF0 */
            ADC_SOUND_IN_DSM_CR17_REG &= (uint8)~ADC_SOUND_IN_DSM_EN_BUF_VREF;
        }
    #endif /* External ref */

    #if (((ADC_SOUND_IN_CFG1_INPUT_RANGE == ADC_SOUND_IN_IR_VSSA_TO_2VREF) || \
         ((ADC_SOUND_IN_DEFAULT_NUM_CONFIGS > 1) && \
          (ADC_SOUND_IN_CFG2_INPUT_RANGE == ADC_SOUND_IN_IR_VSSA_TO_2VREF)) || \
         ((ADC_SOUND_IN_DEFAULT_NUM_CONFIGS > 2) && \
          (ADC_SOUND_IN_CFG3_INPUT_RANGE == ADC_SOUND_IN_IR_VSSA_TO_2VREF)) || \
         ((ADC_SOUND_IN_DEFAULT_NUM_CONFIGS > 3) && \
          (ADC_SOUND_IN_CFG4_INPUT_RANGE == ADC_SOUND_IN_IR_VSSA_TO_2VREF))))
        if(((config == 1u) &&
            (ADC_SOUND_IN_CFG1_INPUT_RANGE == ADC_SOUND_IN_IR_VSSA_TO_2VREF) &&
            ((ADC_SOUND_IN_CFG1_REFERENCE != ADC_SOUND_IN_EXT_REF_ON_P03) &&
             (ADC_SOUND_IN_CFG1_REFERENCE != ADC_SOUND_IN_EXT_REF_ON_P32))) ||
             ((config == 2u) &&
              (ADC_SOUND_IN_CFG2_INPUT_RANGE == ADC_SOUND_IN_IR_VSSA_TO_2VREF) &&
             ((ADC_SOUND_IN_CFG2_REFERENCE != ADC_SOUND_IN_EXT_REF_ON_P03) &&
             (ADC_SOUND_IN_CFG2_REFERENCE != ADC_SOUND_IN_EXT_REF_ON_P32))) ||
             ((config == 3u) &&
              (ADC_SOUND_IN_CFG3_INPUT_RANGE == ADC_SOUND_IN_IR_VSSA_TO_2VREF) &&
             ((ADC_SOUND_IN_CFG3_REFERENCE != ADC_SOUND_IN_EXT_REF_ON_P03) &&
             (ADC_SOUND_IN_CFG3_REFERENCE != ADC_SOUND_IN_EXT_REF_ON_P32))) ||
             ((config == 4u) &&
              (ADC_SOUND_IN_CFG4_INPUT_RANGE == ADC_SOUND_IN_IR_VSSA_TO_2VREF) &&
             ((ADC_SOUND_IN_CFG4_REFERENCE != ADC_SOUND_IN_EXT_REF_ON_P03) &&
             (ADC_SOUND_IN_CFG4_REFERENCE != ADC_SOUND_IN_EXT_REF_ON_P32))))
        {
            /* Enable the REFBUF1 */
            ADC_SOUND_IN_DSM_REF0_REG |= ADC_SOUND_IN_DSM_EN_BUF_VREF_INN;
        }
    #endif /* VSSA_TO_2VREF */
    if(config != 0u)
    {
        /* Suppress compiler warning */
    }

    /* Wait for 3 microseconds */
    CyDelayUs(ADC_SOUND_IN_PRES_DELAY_TIME);

    /* Enable the press circuit */
    ADC_SOUND_IN_RESET_CR4_REG &= (uint8)~ADC_SOUND_IN_IGNORE_PRESA1;
    ADC_SOUND_IN_RESET_CR5_REG &= (uint8)~ADC_SOUND_IN_IGNORE_PRESA2;

    /* Enable negative pumps for DSM  */
    ADC_SOUND_IN_PUMP_CR1_REG  |= ( ADC_SOUND_IN_PUMP_CR1_CLKSEL | ADC_SOUND_IN_PUMP_CR1_FORCE );

    /* Enable Modulator Chopping if required */
    ADC_SOUND_IN_DSM_CR2_REG = ADC_SOUND_IN_CFG1_DSM_CR2;

    /* This is only valid if there is an internal clock */
    #if(ADC_SOUND_IN_DEFAULT_INTERNAL_CLK)
        ADC_SOUND_IN_PWRMGR_CLK_REG |= ADC_SOUND_IN_ACT_PWR_CLK_EN;
        ADC_SOUND_IN_STBY_PWRMGR_CLK_REG |= ADC_SOUND_IN_STBY_PWR_CLK_EN;
    #endif /* ADC_SOUND_IN_DEFAULT_INTERNAL_CLK */

    /* Enable the active and alternate active power for charge pump clock */
    ADC_SOUND_IN_PWRMGR_CHARGE_PUMP_CLK_REG |= ADC_SOUND_IN_ACT_PWR_CHARGE_PUMP_CLK_EN;
    ADC_SOUND_IN_STBY_PWRMGR_CHARGE_PUMP_CLK_REG |= ADC_SOUND_IN_STBY_PWR_CHARGE_PUMP_CLK_EN;

    #if(ADC_SOUND_IN_IRQ_REMOVE == 0u)
        /* Clear a pending interrupt */
        CyIntClearPending(ADC_SOUND_IN_INTC_NUMBER);
        /* Enable interrupt */
        CyIntEnable(ADC_SOUND_IN_INTC_NUMBER);
    #endif   /* End ADC_SOUND_IN_IRQ_REMOVE */

