yycliang/6.115-Guitar-Learner/Guitar Learner.cydsn/Generated_Source/PSoC5/ADC_SOUND_IN.c
    CyExitCriticalSection(enableInterrupts);

}


/*******************************************************************************
* Function Name: ADC_SOUND_IN_Start
********************************************************************************
*
* Summary:
*  Performs all required initialization for this component and enables
*  the power. It configure all the register the first time it is called.
*  Subsequent calls of the Start function only enable the ADC and turn
*  on the power. If multiple configurations are selected, it will
*  configure the ADC for configuration 1 by default, unless the
*  ADC_SOUND_IN_SelectConfiguration( ) function has been called to change
*  the default setting.
*
* Parameters:
*  None
*
* Return:
*  None
*
* Global variables:
*  ADC_SOUND_IN_initVar:  Used to check the initial configuration,
*  modified when this function is called for the first time.
*
*******************************************************************************/
void ADC_SOUND_IN_Start(void) 
{
    if(ADC_SOUND_IN_initVar == 0u)
    {
        if(ADC_SOUND_IN_started == 0u)
        {
            ADC_SOUND_IN_Init();
        }
        ADC_SOUND_IN_initVar = 1u;
    }

    /* Enable the ADC */
    ADC_SOUND_IN_Enable();
}


/*******************************************************************************
* Function Name: ADC_SOUND_IN_Stop
********************************************************************************
*
* Summary:
*  This function stops and powers down the ADC component and the internal
*  clock if the external clock is not selected. If an external clock is
*  used, it is up to the designer to power down the external clock it
*  required.
*
* Parameters:
*  None
*
* Return:
*  None
*
*******************************************************************************/
void ADC_SOUND_IN_Stop(void) 
{
    uint8 enableInterrupts;
    enableInterrupts = CyEnterCriticalSection();

    /* Stop conversions */
    ADC_SOUND_IN_DEC_CR_REG &= (uint8)~ADC_SOUND_IN_DEC_START_CONV;
    ADC_SOUND_IN_DEC_SR_REG |=  ADC_SOUND_IN_DEC_INTR_CLEAR;

    /* Disable PRES, Disable power to VCMBUF0, REFBUF0 and REFBUF1,
       enable PRES */
    ADC_SOUND_IN_RESET_CR4_REG |= ADC_SOUND_IN_IGNORE_PRESA1;
    ADC_SOUND_IN_RESET_CR5_REG |= ADC_SOUND_IN_IGNORE_PRESA2;

    ADC_SOUND_IN_DSM_CR17_REG &= (uint8)~(ADC_SOUND_IN_DSM_EN_BUF_VREF | ADC_SOUND_IN_DSM_EN_BUF_VCM);
    ADC_SOUND_IN_DSM_REF0_REG &= (uint8)~ADC_SOUND_IN_DSM_EN_BUF_VREF_INN;

    /* Wait for 3 microseconds. */
    CyDelayUs(ADC_SOUND_IN_PRES_DELAY_TIME);

    /* Enable the press circuit */
    ADC_SOUND_IN_RESET_CR4_REG &= (uint8)~ADC_SOUND_IN_IGNORE_PRESA1;
    ADC_SOUND_IN_RESET_CR5_REG &= (uint8)~ADC_SOUND_IN_IGNORE_PRESA2;

    /* Disable power to the ADC */
    ADC_SOUND_IN_PWRMGR_DSM_REG &= (uint8)~ADC_SOUND_IN_ACT_PWR_DSM_EN;

    /* Disable power to Decimator block */
    ADC_SOUND_IN_PWRMGR_DEC_REG &= (uint8)~ADC_SOUND_IN_ACT_PWR_DEC_EN;

    /* Disable alternative active power to the ADC */
    ADC_SOUND_IN_STBY_PWRMGR_DEC_REG &= (uint8)~ADC_SOUND_IN_STBY_PWR_DEC_EN;
    ADC_SOUND_IN_STBY_PWRMGR_DSM_REG &= (uint8)~ADC_SOUND_IN_STBY_PWR_DSM_EN;

   /* Disable negative pumps for DSM  */
    ADC_SOUND_IN_PUMP_CR1_REG &= (uint8)~(ADC_SOUND_IN_PUMP_CR1_CLKSEL | ADC_SOUND_IN_PUMP_CR1_FORCE );

    /* This is only valid if there is an internal clock */
    #if(ADC_SOUND_IN_DEFAULT_INTERNAL_CLK)
        ADC_SOUND_IN_PWRMGR_CLK_REG &= (uint8)~ADC_SOUND_IN_ACT_PWR_CLK_EN;
        ADC_SOUND_IN_STBY_PWRMGR_CLK_REG &= (uint8)~ADC_SOUND_IN_STBY_PWR_CLK_EN;
    #endif /* ADC_SOUND_IN_DEFAULT_INTERNAL_CLK */

    /* Disable Modulator Chopping */
    ADC_SOUND_IN_DSM_CR2_REG &= (uint8)~ADC_SOUND_IN_DSM_MOD_CHOP_EN;
    /* Disable power to charge pump clock */
    ADC_SOUND_IN_PWRMGR_CHARGE_PUMP_CLK_REG &= (uint8)~ADC_SOUND_IN_ACT_PWR_CHARGE_PUMP_CLK_EN;
    ADC_SOUND_IN_STBY_PWRMGR_CHARGE_PUMP_CLK_REG &= (uint8)~ADC_SOUND_IN_STBY_PWR_CHARGE_PUMP_CLK_EN;
    
    CyExitCriticalSection(enableInterrupts);
}


/*******************************************************************************
* Function Name: ADC_SOUND_IN_SetBufferGain
********************************************************************************
*
* Summary:
*  Sets input buffer gain.
*
* Parameters:
*  gain:  Two bit value to select a gain of 1, 2, 4, or 8.
*
* Return:
*  None
*
*******************************************************************************/
void ADC_SOUND_IN_SetBufferGain(uint8 gain) 
{
    uint8 tmpReg;
    tmpReg = ADC_SOUND_IN_DSM_BUF1_REG & (uint8)~ADC_SOUND_IN_DSM_GAIN_MASK;
    tmpReg |= (uint8)(gain << ADC_SOUND_IN_DSM_GAIN_SHIFT) & ADC_SOUND_IN_DSM_GAIN_MASK;
    ADC_SOUND_IN_DSM_BUF1_REG = tmpReg;
}


/*******************************************************************************
* Function Name: ADC_SOUND_IN_SetCoherency
********************************************************************************
*
* Summary:
*  This function allows the user to change which of the ADC's 3 word
*  result will trigger a coherency unlock. The ADC's result will not be
*  updated until the set byte is read either by the ADC or DMA. 
*  By default the LSB is the coherency byte for right alignment data format. 
*  The middle or high byte is set automatically depend on left alignment 
*  configuration for DMA data transfer.
*  If DMA or if a custom API requires different byte to be read the last,
*  this API should be used to set the last byte of the ADC result that is read. 
*  If a multibyte read is performed either by DMA or the ARM processor, the
*  coherency can be set to any byte in the last word read.
*
* Parameters:
*  coherency:  Two bit value to set the coherency bit.
*           00-Coherency checking off
*           01-low byte is key byte
*           02-middle byte is the key byte
*           03-high byte is the key byte
*
* Return:
*  None
*
*******************************************************************************/
void ADC_SOUND_IN_SetCoherency(uint8 coherency) 
{
    uint8 tmpReg;

