yycliang/6.115-Guitar-Learner/Guitar Learner.cydsn/Generated_Source/PSoC5/ADC_SOUND_IN.c
            /* Set the Conversion stop if resolution is above 16 bit and
            *   conversion mode is Single sample
            */
            #if(ADC_SOUND_IN_CFG2_RESOLUTION > 16 && \
                ADC_SOUND_IN_CFG2_CONV_MODE == ADC_SOUND_IN_MODE_SINGLE_SAMPLE)
                ADC_SOUND_IN_stopConversion = 1u;
            #endif /* Single sample with resolution above 16 bits. */

            ADC_SOUND_IN_CountsPerVolt = (int32)ADC_SOUND_IN_CFG2_COUNTS_PER_VOLT;

            ADC_SOUND_IN_Ext_CP_Clk_SetDividerRegister(ADC_SOUND_IN_CFG2_CP_CLK_DIVIDER, 1u);

            /* This is only valid if there is an internal clock */
            #if(ADC_SOUND_IN_DEFAULT_INTERNAL_CLK)
                ADC_SOUND_IN_theACLK_SetDividerRegister(ADC_SOUND_IN_CFG2_ADC_CLK_DIVIDER, 1u);
            #endif /* ADC_SOUND_IN_DEFAULT_INTERNAL_CLK */

            #if(ADC_SOUND_IN_IRQ_REMOVE == 0u)
                /* Set interrupt vector */
                (void)CyIntSetVector(ADC_SOUND_IN_INTC_NUMBER, &ADC_SOUND_IN_ISR2);
            #endif   /* End ADC_SOUND_IN_IRQ_REMOVE */
        }
    #endif /* ADC_SOUND_IN_DEFAULT_NUM_CONFIGS > 1 */

    #if(ADC_SOUND_IN_DEFAULT_NUM_CONFIGS > 2)
        if(config == 3u)
        {
            /* Third Config */
            ADC_SOUND_IN_DEC_CR_REG      = ADC_SOUND_IN_CFG3_DEC_CR;
            ADC_SOUND_IN_DEC_SHIFT1_REG  = ADC_SOUND_IN_CFG3_DEC_SHIFT1;
            ADC_SOUND_IN_DEC_SHIFT2_REG  = ADC_SOUND_IN_CFG3_DEC_SHIFT2;
            ADC_SOUND_IN_DEC_DR2_REG     = ADC_SOUND_IN_CFG3_DEC_DR2;
            ADC_SOUND_IN_DEC_DR2H_REG    = ADC_SOUND_IN_CFG3_DEC_DR2H;
            ADC_SOUND_IN_DEC_DR1_REG     = ADC_SOUND_IN_CFG3_DEC_DR1;
            ADC_SOUND_IN_DEC_OCOR_REG    = ADC_SOUND_IN_CFG3_DEC_OCOR;
            ADC_SOUND_IN_DEC_OCORM_REG   = ADC_SOUND_IN_CFG3_DEC_OCORM;
            ADC_SOUND_IN_DEC_OCORH_REG   = ADC_SOUND_IN_CFG3_DEC_OCORH;
            ADC_SOUND_IN_DEC_COHER_REG   = ADC_SOUND_IN_CFG3_DEC_COHER;

            ADC_SOUND_IN_DSM_CR4_REG     = ADC_SOUND_IN_CFG3_DSM_CR4;
            ADC_SOUND_IN_DSM_CR5_REG     = ADC_SOUND_IN_CFG3_DSM_CR5;
            ADC_SOUND_IN_DSM_CR6_REG     = ADC_SOUND_IN_CFG3_DSM_CR6;
            ADC_SOUND_IN_DSM_CR7_REG     = ADC_SOUND_IN_CFG3_DSM_CR7;
            ADC_SOUND_IN_DSM_CR10_REG    = ADC_SOUND_IN_CFG3_DSM_CR10;
            ADC_SOUND_IN_DSM_CR11_REG    = ADC_SOUND_IN_CFG3_DSM_CR11;
            ADC_SOUND_IN_DSM_CR12_REG    = ADC_SOUND_IN_CFG3_DSM_CR12;
            ADC_SOUND_IN_DSM_CR14_REG    = ADC_SOUND_IN_CFG3_DSM_CR14;
            ADC_SOUND_IN_DSM_CR15_REG    = ADC_SOUND_IN_CFG3_DSM_CR15;
            ADC_SOUND_IN_DSM_CR16_REG    = ADC_SOUND_IN_CFG3_DSM_CR16;
            ADC_SOUND_IN_DSM_CR17_REG    = ADC_SOUND_IN_CFG3_DSM_CR17;
            /* Set DSM_REF0_REG by disabling and enabling the PRESS circuit */
            ADC_SOUND_IN_SetDSMRef0Reg(ADC_SOUND_IN_CFG3_DSM_REF0);
            ADC_SOUND_IN_DSM_REF2_REG    = ADC_SOUND_IN_CFG3_DSM_REF2;
            ADC_SOUND_IN_DSM_REF3_REG    = ADC_SOUND_IN_CFG3_DSM_REF3;

            ADC_SOUND_IN_DSM_BUF0_REG    = ADC_SOUND_IN_CFG3_DSM_BUF0;
            ADC_SOUND_IN_DSM_BUF1_REG    = ADC_SOUND_IN_CFG3_DSM_BUF1;
            ADC_SOUND_IN_DSM_BUF2_REG    = ADC_SOUND_IN_CFG3_DSM_BUF2;
            ADC_SOUND_IN_DSM_BUF3_REG    = ADC_SOUND_IN_CFG3_DSM_BUF3;

            /* To select either Vssa or Vref to -ve input of DSM depending on
            *  the input range selected.
            */
            #if(ADC_SOUND_IN_DEFAULT_INPUT_MODE)
                #if (ADC_SOUND_IN_CFG3_INPUT_RANGE == ADC_SOUND_IN_IR_VSSA_TO_2VREF)
                    ADC_SOUND_IN_AMux_Select(1u);
                #else
                    ADC_SOUND_IN_AMux_Select(0u);
                #endif /* ADC_SOUND_IN_IR_VSSA_TO_2VREF) */
            #endif /* ADC_SOUND_IN_DEFAULT_INPUT_MODE */

            /* Set the Conversion stop if resolution is above 16 bit and
               conversion  mode is Single sample */
            #if(ADC_SOUND_IN_CFG3_RESOLUTION > 16 && \
                ADC_SOUND_IN_CFG3_CONV_MODE == ADC_SOUND_IN_MODE_SINGLE_SAMPLE)
                ADC_SOUND_IN_stopConversion = 1u;
            #endif /* Single sample with resolution above 16 bits */

            ADC_SOUND_IN_CountsPerVolt = (int32)ADC_SOUND_IN_CFG3_COUNTS_PER_VOLT;

            ADC_SOUND_IN_Ext_CP_Clk_SetDividerRegister(ADC_SOUND_IN_CFG3_CP_CLK_DIVIDER, 1u);

            /* This is only valid if there is an internal clock */
            #if(ADC_SOUND_IN_DEFAULT_INTERNAL_CLK)
                ADC_SOUND_IN_theACLK_SetDividerRegister(ADC_SOUND_IN_CFG3_ADC_CLK_DIVIDER, 1u);
            #endif /* ADC_SOUND_IN_DEFAULT_INTERNAL_CLK */

            #if(ADC_SOUND_IN_IRQ_REMOVE == 0u)
                /* Set interrupt vector */
                (void)CyIntSetVector(ADC_SOUND_IN_INTC_NUMBER, &ADC_SOUND_IN_ISR3);
            #endif   /* End ADC_SOUND_IN_IRQ_REMOVE */
        }
    #endif /* ADC_SOUND_IN_DEFAULT_NUM_CONFIGS > 2 */

    #if(ADC_SOUND_IN_DEFAULT_NUM_CONFIGS > 3)
        if (config == 4u)
        {
            /* Fourth Config */
            ADC_SOUND_IN_DEC_CR_REG      = ADC_SOUND_IN_CFG4_DEC_CR;
            ADC_SOUND_IN_DEC_SHIFT1_REG  = ADC_SOUND_IN_CFG4_DEC_SHIFT1;
            ADC_SOUND_IN_DEC_SHIFT2_REG  = ADC_SOUND_IN_CFG4_DEC_SHIFT2;
            ADC_SOUND_IN_DEC_DR2_REG     = ADC_SOUND_IN_CFG4_DEC_DR2;
            ADC_SOUND_IN_DEC_DR2H_REG    = ADC_SOUND_IN_CFG4_DEC_DR2H;
            ADC_SOUND_IN_DEC_DR1_REG     = ADC_SOUND_IN_CFG4_DEC_DR1;
            ADC_SOUND_IN_DEC_OCOR_REG    = ADC_SOUND_IN_CFG4_DEC_OCOR;
            ADC_SOUND_IN_DEC_OCORM_REG   = ADC_SOUND_IN_CFG4_DEC_OCORM;
            ADC_SOUND_IN_DEC_OCORH_REG   = ADC_SOUND_IN_CFG4_DEC_OCORH;
            ADC_SOUND_IN_DEC_COHER_REG   = ADC_SOUND_IN_CFG4_DEC_COHER;

            ADC_SOUND_IN_DSM_CR4_REG     = ADC_SOUND_IN_CFG4_DSM_CR4;
            ADC_SOUND_IN_DSM_CR5_REG     = ADC_SOUND_IN_CFG4_DSM_CR5;
            ADC_SOUND_IN_DSM_CR6_REG     = ADC_SOUND_IN_CFG4_DSM_CR6;
            ADC_SOUND_IN_DSM_CR7_REG     = ADC_SOUND_IN_CFG4_DSM_CR7;
            ADC_SOUND_IN_DSM_CR10_REG    = ADC_SOUND_IN_CFG4_DSM_CR10;
            ADC_SOUND_IN_DSM_CR11_REG    = ADC_SOUND_IN_CFG4_DSM_CR11;
            ADC_SOUND_IN_DSM_CR12_REG    = ADC_SOUND_IN_CFG4_DSM_CR12;
            ADC_SOUND_IN_DSM_CR14_REG    = ADC_SOUND_IN_CFG4_DSM_CR14;
            ADC_SOUND_IN_DSM_CR15_REG    = ADC_SOUND_IN_CFG4_DSM_CR15;
            ADC_SOUND_IN_DSM_CR16_REG    = ADC_SOUND_IN_CFG4_DSM_CR16;
            ADC_SOUND_IN_DSM_CR17_REG    = ADC_SOUND_IN_CFG4_DSM_CR17;
            /* Set DSM_REF0_REG by disabling and enabling the PRESS circuit */
            ADC_SOUND_IN_SetDSMRef0Reg(ADC_SOUND_IN_CFG4_DSM_REF0);
            ADC_SOUND_IN_DSM_REF2_REG    = ADC_SOUND_IN_CFG4_DSM_REF2;
            ADC_SOUND_IN_DSM_REF3_REG    = ADC_SOUND_IN_CFG4_DSM_REF3;

            ADC_SOUND_IN_DSM_BUF0_REG    = ADC_SOUND_IN_CFG4_DSM_BUF0;
            ADC_SOUND_IN_DSM_BUF1_REG    = ADC_SOUND_IN_CFG4_DSM_BUF1;
            ADC_SOUND_IN_DSM_BUF2_REG    = ADC_SOUND_IN_CFG4_DSM_BUF2;
            ADC_SOUND_IN_DSM_BUF3_REG    = ADC_SOUND_IN_CFG4_DSM_BUF3;

            /* To select either Vssa or Vref to -ve input of DSM depending on
            *  the input range selected.
            */
            #if(ADC_SOUND_IN_DEFAULT_INPUT_MODE)
                #if (ADC_SOUND_IN_CFG4_INPUT_RANGE == ADC_SOUND_IN_IR_VSSA_TO_2VREF)
                    ADC_SOUND_IN_AMux_Select(1u);
                #else
                    ADC_SOUND_IN_AMux_Select(0u);
                #endif /* ADC_SOUND_IN_IR_VSSA_TO_2VREF) */
            #endif /* ADC_SOUND_IN_DEFAULT_INPUT_MODE */

