yycliang/6.115-Guitar-Learner/Guitar Learner.cydsn/Generated_Source/PSoC5/ADC_SOUND_IN.c
            /* Set the Conversion stop if resolution is above 16 bit and
               conversion mode is Single sample */
            #if(ADC_SOUND_IN_CFG4_RESOLUTION > 16 && \
                ADC_SOUND_IN_CFG4_CONV_MODE == ADC_SOUND_IN_MODE_SINGLE_SAMPLE)
                ADC_SOUND_IN_stopConversion = 1u;
            #endif /* Single sample with resolution above 16 bits */

            ADC_SOUND_IN_CountsPerVolt = (int32)ADC_SOUND_IN_CFG4_COUNTS_PER_VOLT;

            ADC_SOUND_IN_Ext_CP_Clk_SetDividerRegister(ADC_SOUND_IN_CFG4_CP_CLK_DIVIDER, 1u);

            /* This is only valid if there is an internal clock */
            #if(ADC_SOUND_IN_DEFAULT_INTERNAL_CLK)
                ADC_SOUND_IN_theACLK_SetDividerRegister(ADC_SOUND_IN_CFG4_ADC_CLK_DIVIDER, 1u);
            #endif /* ADC_SOUND_IN_DEFAULT_INTERNAL_CLK */

            #if(ADC_SOUND_IN_IRQ_REMOVE == 0u)
                /* Set interrupt vector */
                (void)CyIntSetVector(ADC_SOUND_IN_INTC_NUMBER, &ADC_SOUND_IN_ISR4);
            #endif   /* End ADC_SOUND_IN_IRQ_REMOVE */
        }
    #endif /* ADC_SOUND_IN_DEFAULT_NUM_CONFIGS > 3 */
}


/*******************************************************************************
* Function Name: ADC_SOUND_IN_SelectCofiguration
********************************************************************************
*
* Summary:
*  Sets one of up to four ADC configurations. Before setting the new
*  configuration, the ADC is stopped and powered down. After setting
*  the new configuration, the ADC can be powered and conversion
*  can be restarted depending up on the value of second parameter
*  restart. If the value of this parameter is 1, then ADC will be
*  restarted. If this value is zero, then user must call ADC_SOUND_IN_Start
*  and ADC_SOUND_IN_StartConvert() to restart the conversion.
*
* Parameters:
*  config:  configuration user wants to select.
*           Valid range: 1..4
*  restart:  Restart option. 1 means start the ADC and restart the conversion.
*                            0 means do not start the ADC and conversion.
*
* Return:
*  None
*
*******************************************************************************/
void ADC_SOUND_IN_SelectConfiguration(uint8 config, uint8 restart)
                                              
{
    /* Check whether the configuration number is valid or not */
    if((config > 0u) && (config <= ADC_SOUND_IN_DEFAULT_NUM_CONFIGS))
    {
        /* Set the flag to ensure Start() API doesn't override the 
		*  selected configuration
		*/
        if(ADC_SOUND_IN_initVar == 0u)
        {
            ADC_SOUND_IN_started = 1u;
        }

        /* Update the config flag */
        ADC_SOUND_IN_Config = config;

        /* Stop the ADC  */
        ADC_SOUND_IN_Stop();

        /* Set the  ADC registers based on the configuration */
        ADC_SOUND_IN_InitConfig(config);

        /* Compensate the gain */
        ADC_SOUND_IN_DEC_GVAL_REG = ADC_SOUND_IN_gcor[config - 1u].gval;
        CY_SET_REG16(ADC_SOUND_IN_DEC_GCOR_16B_PTR, ADC_SOUND_IN_gcor[config - 1u].gcor);

        if(restart == 1u)
        {
            /* Restart the ADC */
            ADC_SOUND_IN_Start();

            /* Restart the ADC conversion */
            ADC_SOUND_IN_StartConvert();
        }
    }
    else
    {
        /* Halt CPU in debug mode if config is out of valid range */
        CYASSERT(0u != 0u);
    }
}


/*******************************************************************************
* Function Name: ADC_SOUND_IN_GainCompensation
********************************************************************************
*
* Summary:
*  This API calculates the trim value and then store this to gcor structure.
*
* Parameters:
*  inputRange:  input range for which trim value is to be calculated.
*  IdealDecGain:  Ideal Decimator gain for the selected resolution and
*                 conversion  mode.
*  IdealOddDecGain:  Ideal odd decimation gain for the selected resolution and
                     conversion mode.
*  resolution:  Resolution to select the proper flash location for trim value.
*  config:      Specifies the configuration number
*               Valid range: 1..4
*
* Return:
*  None
*
*******************************************************************************/
static void ADC_SOUND_IN_GainCompensation(uint8 inputRange, uint16 idealDecGain, uint16 idealOddDecGain,
                              uint8 resolution, uint8 config) 
{
    int8 flash;
	int32 normalised;
	uint16 gcorValue;
    uint32 gcorTmp;

    if((config > 0u) && (config <= ADC_SOUND_IN_DEFAULT_NUM_CONFIGS))
    {
        switch(inputRange)
        {
            case ADC_SOUND_IN_IR_VNEG_VREF_DIFF:
            case ADC_SOUND_IN_IR_VSSA_TO_2VREF:
                /* Normalize the flash Value */
                if(resolution > 15u)
                {
                    flash = ADC_SOUND_IN_DEC_TRIM_VREF_DIFF_16_20;
                }
                else
                {
                    flash = ADC_SOUND_IN_DEC_TRIM_VREF_DIFF_8_15;
                }
                break;

            case ADC_SOUND_IN_IR_VNEG_VREF_2_DIFF:
                /* Normalize the flash Value */
                if(resolution > 15u)
                {
                    flash = ADC_SOUND_IN_DEC_TRIM_VREF_2_DIFF_16_20;
                }
                else
                {
                    flash = ADC_SOUND_IN_DEC_TRIM_VREF_2_DIFF_8_15;
                }
                break;

            case ADC_SOUND_IN_IR_VNEG_VREF_4_DIFF:
                /* Normalize the flash Value */
                if(resolution > 15u)
                {
                    flash = ADC_SOUND_IN_DEC_TRIM_VREF_4_DIFF_16_20;
                }
                else
                {
                    flash = ADC_SOUND_IN_DEC_TRIM_VREF_4_DIFF_8_15;
                }
                break;

            case ADC_SOUND_IN_IR_VNEG_VREF_16_DIFF:
                /* Normalize the flash Value */
                if(resolution > 15u)
                {
                    flash = ADC_SOUND_IN_DEC_TRIM_VREF_16_DIFF_16_20;
                }
                else
                {
                    flash = ADC_SOUND_IN_DEC_TRIM_VREF_16_DIFF_8_15;
                }
                break;

            default:
                flash = 0;
                break;
        }

