yycliang/6.115-Guitar-Learner/Guitar Learner.cydsn/Generated_Source/PSoC5/ADC_SOUND_IN.c
        /* Add two values */
		normalised = (int32)idealDecGain + ((int32)flash * 32);
        gcorTmp = (uint32)normalised * (uint32)idealOddDecGain;
        gcorValue = (uint16)(gcorTmp / ADC_SOUND_IN_IDEAL_GAIN_CONST);

        if (resolution < (ADC_SOUND_IN_MAX_GVAL - 1u))
        {
            gcorValue = (gcorValue >> (ADC_SOUND_IN_MAX_GVAL - (resolution + 1u)));
            ADC_SOUND_IN_gcor[config - 1u].gval = (resolution + 1u);
        }
        else
        {
            /* Use all 16 bits */
            ADC_SOUND_IN_gcor[config - 1u].gval = ADC_SOUND_IN_MAX_GVAL;
        }

        /* Save the gain correction register value */
        ADC_SOUND_IN_gcor[config - 1u].gcor = gcorValue;
    }
    else
    {
        /* Halt CPU in debug mode if config is out of valid range */
        CYASSERT(0u != 0u);
    }
}


/******************************************************************************
* Function Name: ADC_SOUND_IN_SetDSMRef0Reg(uint8)
******************************************************************************
*
* Summary:
*  This API sets the DSM_REF0 register. This is written for internal use.
*
* Parameters:
*  value:  Value to be written to DSM_REF0 register.
*
* Return:
*  None
*
******************************************************************************/
static void ADC_SOUND_IN_SetDSMRef0Reg(uint8 value) 
{
    uint8 enableInterrupts;
    enableInterrupts = CyEnterCriticalSection();

    /* Disable PRES, Enable power to VCMBUF0, REFBUF0 and REFBUF1, enable PRES */
    ADC_SOUND_IN_RESET_CR4_REG |= (ADC_SOUND_IN_IGNORE_PRESA1 | ADC_SOUND_IN_IGNORE_PRESD1);
    ADC_SOUND_IN_RESET_CR5_REG |= (ADC_SOUND_IN_IGNORE_PRESA2 | ADC_SOUND_IN_IGNORE_PRESD2);
    ADC_SOUND_IN_DSM_REF0_REG = value;

    /* Wait for 3 microseconds */
    CyDelayUs(ADC_SOUND_IN_PRES_DELAY_TIME);
    /* Enable the press circuit */
    ADC_SOUND_IN_RESET_CR4_REG &= (uint8)~(ADC_SOUND_IN_IGNORE_PRESA1 | ADC_SOUND_IN_IGNORE_PRESD1);
    ADC_SOUND_IN_RESET_CR5_REG &= (uint8)~(ADC_SOUND_IN_IGNORE_PRESA2 | ADC_SOUND_IN_IGNORE_PRESD2);

    CyExitCriticalSection(enableInterrupts);
}


/*******************************************************************************
* Function Name: ADC_SOUND_IN_Read8
********************************************************************************
*
* Summary:
*  This function simplifies getting results from the ADC when only a
*  single reading is required. When called, it will start ADC
*  conversions, wait for the conversion to be complete, stop ADC
*  conversion and return the result. This is a blocking function and will
*  not return until the result is ready.
*
* Parameters:
*  None
*
* Return:
*  int8:  ADC result.
*
*******************************************************************************/
int8 ADC_SOUND_IN_Read8(void) 
{
    int8 result;

    /* Clear pending conversion done status */
    ADC_SOUND_IN_DEC_SR_REG |= ADC_SOUND_IN_DEC_INTR_CLEAR;
    ADC_SOUND_IN_StartConvert();
    (void)ADC_SOUND_IN_IsEndConversion(ADC_SOUND_IN_WAIT_FOR_RESULT);
     result = ADC_SOUND_IN_GetResult8();
    ADC_SOUND_IN_StopConvert();
    
     return(result);
}


/*******************************************************************************
* Function Name: ADC_SOUND_IN_Read16
********************************************************************************
*
* Summary:
*  This function simplifies getting results from the ADC when only a
*  single reading is required. When called, it will start ADC
*  conversions, wait for the conversion to be complete, stop ADC
*  conversion and return the result. This is a blocking function and will
*  not return until the result is ready.
*
* Parameters:
*   void
*
* Return:
*  int16:  ADC result.
*
*******************************************************************************/
int16 ADC_SOUND_IN_Read16(void) 
{
    int16 result;

    /* Clear pending conversion done status */
    ADC_SOUND_IN_DEC_SR_REG |= ADC_SOUND_IN_DEC_INTR_CLEAR;
    ADC_SOUND_IN_StartConvert();
    (void)ADC_SOUND_IN_IsEndConversion(ADC_SOUND_IN_WAIT_FOR_RESULT);
     result = ADC_SOUND_IN_GetResult16();
    ADC_SOUND_IN_StopConvert();
    
     return(result);
}


/*******************************************************************************
* Function Name: ADC_SOUND_IN_Read32
********************************************************************************
*
* Summary:
*  This function simplifies getting results from the ADC when only a
*  single reading is required. When called, it will start ADC
*  conversions, wait for the conversion to be complete, stop ADC
*  conversion and return the result. This is a blocking function and will
*  not return until the result is ready.
*
* Parameters:
*  None
*
* Return:
*  int32: ADC result.
*
*******************************************************************************/
int32 ADC_SOUND_IN_Read32(void) 
{
    int32 result;
    
    /* Clear pending conversion done status */
    ADC_SOUND_IN_DEC_SR_REG |= ADC_SOUND_IN_DEC_INTR_CLEAR;
    ADC_SOUND_IN_StartConvert();
    (void)ADC_SOUND_IN_IsEndConversion(ADC_SOUND_IN_WAIT_FOR_RESULT);
     result = ADC_SOUND_IN_GetResult32();
    ADC_SOUND_IN_StopConvert();
    
     return(result);
}


/* [] END OF FILE */
